//! process - глобальний об'єкт завдяки якому ми можемо отримати інформацію про конкретний процес
// console.log(process.pid) //? id процесу
// console.log(process.env) //? глобальні змінні, в яких ми можемо зберігати важливу для проекту інформацію

//**====================================================== dotenv =====================================*/
//? для отримання інформації з файлу .env
// const dotenv = require("dotenv")
// dotenv.config()

// console.log(process.env.PORT)
// console.log(process.env.NODE_ENV)

//**=============================== Досуп до вписанх в консоль команд ==================================*/
console.log(process.argv) //? доступ до списку команд, які ми отримуємо при запуску файлу із консолі

//** =============================================== Вихід з процесу ===================================*/
process.exit()
